#!/bin/bash

# Скріпт на Bash для розпаковки файла, який міститься в директорії. Шлях до директорії з файлом для розпаковки передається агрументом під час виклику скріпта. Розпаковка ведеться в поточну директорію, зберігаючи структуру файлів і вкладених директорій.
# Перед розпаковкою перевіряється існування файла в директорії і розширення файлу: якщо це zip, то використовується unzip, а якщо tar - використовується tar, інакше повідомляється про те, що розпакувати неможливо.

# Перевірка, чи було передано шлях до директорії як аргумент
if [ "$#" -ne 1 ]; then
    echo "Потрібно передати лише один аргумент - шлях до директорії з файлом для розпакування"
    exit 1
fi

# Перевірка, чи директорія і файл існують
if [ ! -d "$1" ]; then
    echo "Директорію не знайдено"
    exit 1
fi

file_to_unpack=$(find "$1" -type f -maxdepth 1)

if [ -z "$file_to_unpack" ]; then
    echo "Файл для розпакування не знайдено"
    exit 1
fi

# Отримання розширення файлу
extension="${file_to_unpack##*.}"

# Розпакування в залежності від розширення
case "$extension" in
    zip)
        unzip -d "$(dirname "$file_to_unpack")" "$file_to_unpack"
        ;;
    tar)
        tar -C "$(dirname "$file_to_unpack")" -xvf "$file_to_unpack"
        ;;
    *)
        echo "Неможливо розпакувати файл з розширенням $extension"
        exit 1
        ;;
esac  